app/controllers/events_controller.rb

SELECT * FROM "events" WHERE (starttime >= '2012-08-26 00:00:00' and endtime <= '2012-10-07 00:00:00' )
SELECT * FROM "users" WHERE ("users"."id" = 21)
---
  def get_events
    if params[:id]
      @events = Event.find(:all,:conditions => ["starttime >= '#{Time.at(params['start'].to_i).to_formatted_s(:db)}' and endtime <= '#{Time.at(params['end'].to_i).to_formatted_s(:db)}' and meeting_room = '#{params[:id]}'"])
    else
      @events = Event.find(:all, :conditions => ["starttime >= '#{Time.at(params['start'].to_i).to_formatted_s(:db)}' and endtime <= '#{Time.at(params['end'].to_i).to_formatted_s(:db)}' "])
    end
    events = []
    @events.each do |event|
      events << {:id => event.id, :title => event.title,:username => event.user.first_name, :description => event.description || "Some cool description here...", :start => "#{event.starttime.iso8601}", :end => "#{event.endtime.iso8601}", :allDay => event.all_day,:meeting_room=>event.meeting_room, :recurring => (event.event_series_id)? true: false}

SELECT * FROM "events" WHERE ("events"."id" = '8697') AND ("events".user_id = 21) LIMIT 1
---
  def edit
    @event = current_user.events.find_by_id(params[:id])

SELECT * FROM "events" WHERE ("events".event_series_id = 106)
DELETE FROM "event_series" WHERE "id" = 106
DELETE FROM "events" WHERE "id" = 8697
SELECT * FROM "event_series" WHERE ("event_series"."id" = 106)
---
  def destroy
    @event = Event.find_by_id(params[:id])
    if params[:delete_all] == 'true'
      @event.event_series.destroy
    elsif params[:delete_all] == 'future'
      @events = @event.event_series.events.find(:all, :conditions => ["starttime > '#{@event.starttime.to_formatted_s(:db)}' "])