app/controllers/meetingrooms_controller.rb

SELECT * FROM "meetingrooms"
---
  def index
    @meetingrooms = Meetingroom.all

SELECT * FROM "meetingrooms" WHERE ("meetingrooms"."id" = 1)
---
  def edit
    @meetingroom = Meetingroom.find(params[:id])

SELECT * FROM "meetingrooms"
---
  def collection
    @meetingroom_dropdown = Meetingroom.all.map{|i| "<option value='#{i.id}'>#{i.name}</option>"}.join