app/controllers/password_resets_controller.rb

SELECT "users".id FROM "users" WHERE ("users"."email" = 'rakshit.joshi@softwebsolutions.com' AND "users".id <> 63) LIMIT 1
---
  def create
  	user = User.find_by_email(params[:email])

SELECT * FROM "users" WHERE ("users"."password_reset_token" = '$2a$10$cGdnPePxFs5JFSwC3WENwe') LIMIT 1
---
  def edit
  	@user = User.find_by_password_reset_token!(params[:id])