app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    recipient = @user.email
    password = @user.password
    @user.save!
    UserMailer.deliver_welcome_mail(recipient,login_url,password)
    flash[:notice] = 'User was successfully created.'
    redirect_to login_path
   rescue ActiveRecord::RecordInvalid
    flash.now[:error] = @user.errors.each_full {}.join('<br/>')
---
INSERT INTO "users" ("first_name", "last_name", "department", "email", "password_hash", "password_salt", "created_at", "updated_at", "auth_token", "password_reset_token", "password_reset_sent_at", "active", "uset_type") VALUES('admin', 'admin', '1', 'rakshit.joshi@softwebsolutions.com', '$2a$10$cqq2cJ2hvb8pu3Hd2X4te.YoaDMkRavQjwVGuEx/nRCJZe8zNfRxC', '$2a$10$cqq2cJ2hvb8pu3Hd2X4te.', '2012-09-13 13:09:52', '2012-09-13 13:09:52', NULL, NULL, NULL, 'f', 'f')
SELECT "users".id FROM "users" WHERE ("users"."email" = '') LIMIT 1